In [1]:
import pandas as pd
import numpy as np

In [4]:
dim_customers = pd.read_csv("C:\\Users\perum\Desktop\Code Basics Projects\FMCG Supply Chain Issue\C2 Input for participants\dim_customers.csv")

In [5]:
dim_customers.head(10)

   customer_id      customer_name       city
0       789201          Rel Fresh      Surat
1       789202          Rel Fresh  Ahmedabad
2       789203          Rel Fresh   Vadodara
3       789301  Expression Stores      Surat
4       789303  Expression Stores   Vadodara
5       789101       Vijay Stores      Surat
6       789102       Vijay Stores  Ahmedabad
7       789103       Vijay Stores   Vadodara
8       789121           Coolblue  Ahmedabad
9       789122           Coolblue   Vadodara

In [6]:
dim_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    35 non-null     int64
 1   customer_name  35 non-null     object
 2   city           35 non-null     object
dtypes: int64(1), object(2)
memory usage: 972.0+ bytes

In [7]:
dim_customers.describe()

         customer_id
count      35.000000
mean   789427.857143
std       226.713105
min    789101.000000
25%    789220.500000
50%    789420.000000
75%    789602.000000
max    789903.000000

In [8]:
dim_customers.isnull().sum()

customer_id      0
customer_name    0
city             0
dtype: int64

In [13]:
dim_customers.columns

Index(['customer_id', 'customer_name', 'city'], dtype='object')

In [79]:
dim_date = pd.read_csv("C:\\Users\perum\Desktop\Code Basics Projects\FMCG Supply Chain Issue\C2 Input for participants\dim_date.csv")

In [80]:
dim_date.head(10)

        date     mmm_yy week_no
0  01-Apr-22  01-Apr-22    W 14
1  03-Apr-22  01-Apr-22    W 15
2  04-Apr-22  01-Apr-22    W 15
3  05-Apr-22  01-Apr-22    W 15
4  06-Apr-22  01-Apr-22    W 15
5  07-Apr-22  01-Apr-22    W 15
6  08-Apr-22  01-Apr-22    W 15
7  09-Apr-22  01-Apr-22    W 15
8  10-Apr-22  01-Apr-22    W 16
9  11-Apr-22  01-Apr-22    W 16

In [81]:
dim_date.isnull().sum()

date       0
mmm_yy     0
week_no    0
dtype: int64

In [82]:
dim_date.columns

Index(['date', 'mmm_yy', 'week_no'], dtype='object')

In [83]:
dim_date.head(10)

        date     mmm_yy week_no
0  01-Apr-22  01-Apr-22    W 14
1  03-Apr-22  01-Apr-22    W 15
2  04-Apr-22  01-Apr-22    W 15
3  05-Apr-22  01-Apr-22    W 15
4  06-Apr-22  01-Apr-22    W 15
5  07-Apr-22  01-Apr-22    W 15
6  08-Apr-22  01-Apr-22    W 15
7  09-Apr-22  01-Apr-22    W 15
8  10-Apr-22  01-Apr-22    W 16
9  11-Apr-22  01-Apr-22    W 16

In [84]:
dim_date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 183 entries, 0 to 182
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   date     183 non-null    object
 1   mmm_yy   183 non-null    object
 2   week_no  183 non-null    object
dtypes: object(3)
memory usage: 4.4+ KB

In [85]:
dim_date.head(10)

        date     mmm_yy week_no
0  01-Apr-22  01-Apr-22    W 14
1  03-Apr-22  01-Apr-22    W 15
2  04-Apr-22  01-Apr-22    W 15
3  05-Apr-22  01-Apr-22    W 15
4  06-Apr-22  01-Apr-22    W 15
5  07-Apr-22  01-Apr-22    W 15
6  08-Apr-22  01-Apr-22    W 15
7  09-Apr-22  01-Apr-22    W 15
8  10-Apr-22  01-Apr-22    W 16
9  11-Apr-22  01-Apr-22    W 16

In [25]:
dim_products = pd.read_csv("C:\\Users\perum\Desktop\Code Basics Projects\FMCG Supply Chain Issue\C2 Input for participants\dim_products.csv")

In [26]:
dim_products.head(10)

    product_name  product_id category
0    AM Milk 500    25891101    Dairy
1    AM Milk 250    25891102    Dairy
2    AM Milk 100    25891103    Dairy
3  AM Butter 100    25891201    Dairy
4  AM Butter 250    25891202    Dairy
5  AM Butter 500    25891203    Dairy
6    AM Ghee 250    25891301    Dairy
7    AM Ghee 150    25891302    Dairy
8    AM Ghee 100    25891303    Dairy
9    AM Curd 250    25891401    Dairy

In [27]:
dim_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_name  18 non-null     object
 1   product_id    18 non-null     int64
 2   category      18 non-null     object
dtypes: int64(1), object(2)
memory usage: 564.0+ bytes

In [28]:
dim_products.isnull().sum()

product_name    0
product_id      0
category        0
dtype: int64

In [29]:
dim_products.columns

Index(['product_name', 'product_id', 'category'], dtype='object')

In [30]:
dim_targets_orders = pd.read_csv("C:\\Users\perum\Desktop\Code Basics Projects\FMCG Supply Chain Issue\C2 Input for participants\dim_targets_orders.csv")

In [31]:
dim_targets_orders.head(10)

   customer_id  ontime_target%  infull_target%  otif_target%
0       789201              87              81            70
1       789202              85              81            69
2       789203              92              76            70
3       789301              89              78            69
4       789303              88              78            69
5       789101              86              80            69
6       789102              90              81            73
7       789103              92              67            62
8       789121              78              77            60
9       789122              76              65            49

In [32]:
dim_targets_orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     35 non-null     int64
 1   ontime_target%  35 non-null     int64
 2   infull_target%  35 non-null     int64
 3   otif_target%    35 non-null     int64
dtypes: int64(4)
memory usage: 1.2 KB

In [33]:
dim_targets_orders.isnull().sum()

customer_id       0
ontime_target%    0
infull_target%    0
otif_target%      0
dtype: int64

In [34]:
dim_targets_orders.columns

Index(['customer_id', 'ontime_target%', 'infull_target%', 'otif_target%'], dtype='object')

In [36]:
fact_order_lines = pd.read_csv("C:\\Users\perum\Desktop\Code Basics Projects\FMCG Supply Chain Issue\C2 Input for participants\\fact_order_lines.csv")

In [39]:
fact_order_lines.head(5)

,order_id,order_placement_date,customer_id,product_id,order_qty,agreed_delivery_date,actual_delivery_date,delivery_qty,In Full,On Time,On Time In Full
0,FMR34203601,"Tuesday, March 1, 2022",789203,25891601,110,"Friday, March 4, 2022","Friday, March 4, 2022",110,1,1,1
1,FMR32320302,"Tuesday, March 1, 2022",789320,25891203,347,"Wednesday, March 2, 2022","Wednesday, March 2, 2022",347,1,1,1
2,FMR33320501,"Tuesday, March 1, 2022",789320,25891203,187,"Thursday, March 3, 2022","Thursday, March 3, 2022",150,0,1,0
3,FMR34220601,"Tuesday, March 1, 2022",789220,25891203,235,"Friday, March 4, 2022","Friday, March 4, 2022",235,1,1,1
4,FMR33703603,"Tuesday, March 1, 2022",789703,25891203,176,"Thursday, March 3, 2022","Thursday, March 3, 2022",176,1,1,1

In [40]:
fact_order_lines.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57096 entries, 0 to 57095
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   order_id              57096 non-null  object
 1   order_placement_date  57096 non-null  object
 2   customer_id           57096 non-null  int64
 3   product_id            57096 non-null  int64
 4   order_qty             57096 non-null  int64
 5   agreed_delivery_date  57096 non-null  object
 6   actual_delivery_date  57096 non-null  object
 7   delivery_qty          57096 non-null  int64
 8   In Full               57096 non-null  int64
 9   On Time               57096 non-null  int64
 10  On Time In Full       57096 non-null  int64
dtypes: int64(7), object(4)
memory usage: 4.8+ MB

In [41]:
fact_order_lines.isnull().sum()

order_id                0
order_placement_date    0
customer_id             0
product_id              0
order_qty               0
agreed_delivery_date    0
actual_delivery_date    0
delivery_qty            0
In Full                 0
On Time                 0
On Time In Full         0
dtype: int64

In [42]:
fact_order_lines.columns

Index(['order_id', 'order_placement_date', 'customer_id', 'product_id',
       'order_qty', 'agreed_delivery_date', 'actual_delivery_date',
       'delivery_qty', 'In Full', 'On Time', 'On Time In Full'],
      dtype='object')

In [47]:
fact_order_lines = fact_order_lines.rename(columns={'In Full': 'In_Full', 
                               'On Time': 'On_Time',
                               'On Time In Full': 'On_Time_In_Full'})

In [48]:
fact_order_lines.columns

Index(['order_id', 'order_placement_date', 'customer_id', 'product_id',
       'order_qty', 'agreed_delivery_date', 'actual_delivery_date',
       'delivery_qty', 'In_Full', 'On_Time', 'On_Time_In_Full'],
      dtype='object')

In [49]:
fact_order_lines.head(5)

,order_id,order_placement_date,customer_id,product_id,order_qty,agreed_delivery_date,actual_delivery_date,delivery_qty,In_Full,On_Time,On_Time_In_Full
0,FMR34203601,"Tuesday, March 1, 2022",789203,25891601,110,"Friday, March 4, 2022","Friday, March 4, 2022",110,1,1,1
1,FMR32320302,"Tuesday, March 1, 2022",789320,25891203,347,"Wednesday, March 2, 2022","Wednesday, March 2, 2022",347,1,1,1
2,FMR33320501,"Tuesday, March 1, 2022",789320,25891203,187,"Thursday, March 3, 2022","Thursday, March 3, 2022",150,0,1,0
3,FMR34220601,"Tuesday, March 1, 2022",789220,25891203,235,"Friday, March 4, 2022","Friday, March 4, 2022",235,1,1,1
4,FMR33703603,"Tuesday, March 1, 2022",789703,25891203,176,"Thursday, March 3, 2022","Thursday, March 3, 2022",176,1,1,1

In [54]:
fact_order_lines.columns

Index(['order_id', 'order_placement_date', 'customer_id', 'product_id',
       'order_qty', 'agreed_delivery_date', 'actual_delivery_date',
       'delivery_qty', 'In_Full', 'On_Time', 'On_Time_In_Full'],
      dtype='object')

In [72]:
fact_orders_aggregate = pd.read_csv("C:\\Users\perum\Desktop\Code Basics Projects\FMCG Supply Chain Issue\C2 Input for participants\\fact_orders_aggregate.csv")

In [73]:
fact_orders_aggregate.head(10)

      order_id  customer_id order_placement_date  on_time  in_full  otif
0  FMR32103503       789103            01-Mar-22        1        0     0
1  FMR34103403       789103            01-Mar-22        1        0     0
2  FMR32103602       789103            01-Mar-22        1        0     0
3  FMR33103602       789103            01-Mar-22        1        0     0
4  FMR33103401       789103            01-Mar-22        1        0     0
5  FMR34903603       789903            01-Mar-22        1        0     0
6  FMR32903403       789903            01-Mar-22        1        0     0
7  FMR33903601       789903            01-Mar-22        1        0     0
8  FMR32702601       789702            01-Mar-22        1        0     0
9  FMR34702502       789702            01-Mar-22        1        0     0

In [74]:
fact_orders_aggregate.isnull().sum()

order_id                0
customer_id             0
order_placement_date    0
on_time                 0
in_full                 0
otif                    0
dtype: int64

In [75]:
fact_orders_aggregate.columns

Index(['order_id', 'customer_id', 'order_placement_date', 'on_time', 'in_full',
       'otif'],
      dtype='object')

In [87]:
# Connecting to the MYSQL server to upload the tables in db
from sqlalchemy import create_engine
import urllib.parse

host = 'localhost'
port = '3306'
username = 'root'
password = urllib.parse.quote_plus("Password@123")
database = 'SupplyChain'


engine = create_engine(f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}")

In [63]:
table_name = "customers"
dim_customers.to_sql(table_name,engine,if_exists="replace",index=False)

print(f" Data Successfully loaded into table name {table_name} in database {database}.")

 Data Successfully loaded into table name customers in database SupplyChain.

In [90]:
date = 'dates'
dim_date.to_sql(date,engine,if_exists="replace",index=False)

print(f" Data Successfully loaded into table name {date} in database {database}.")

 Data Successfully loaded into table name dates in database SupplyChain.

In [65]:
products="products"
dim_products.to_sql(products,engine,if_exists="replace",index=False)

print(f" Data Successfully loaded in table {products} in database {database}.")

 Data Successfully loaded in table products in database SupplyChain.

In [66]:
targets_orders="targets_orders"
dim_targets_orders.to_sql(targets_orders,engine,if_exists="replace",index=False)

print(f" Data Successfully loaded in table {targets_orders} in database {database}.")

 Data Successfully loaded in table targets_orders in database SupplyChain.

In [68]:
order_lines = "order_lines"

fact_order_lines.to_sql(order_lines,engine,if_exists="replace",index=False)

print(f" Data loaded successfully into table {order_lines} in database {database}.")

 Data loaded successfully into table order_lines in database SupplyChain.

In [78]:
orders_aggregate = "orders_aggregate"

fact_orders_aggregate.to_sql(orders_aggregate,engine,if_exists="replace",index=False)

print(f" Data loaded successfully into table {orders_aggregate} in database {database}.")

 Data loaded successfully into table orders_aggregate in database SupplyChain.